nxp-mcuxpresso/mcuxsdk-examples/demo_apps/power_mode_switch_mcxw23/power_mode_switch_mcxw23.c
/*
 * Copyright 2022-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include "pin_mux.h"
#include "fsl_power.h"
#include "fsl_rtc.h"
#include "fsl_ostimer.h"
#include "fsl_ctimer.h"
#include "fsl_pint.h"
#include "fsl_inputmux.h"
#include "fsl_gint.h"
#include "fsl_system.h"
#include "app.h"
#include "fsl_wwdt.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define kRESET_CAUSE_NOT_RELEVANT (0x0)
#define kLOWPOWERCFG_NONE         (0x0)
#define SLEEP_TIME_MS             (1500u)

#define GINT0_PORT     kGINT_Port0
#define GINT0_POL_MASK ~(1U << BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN)
#define GINT0_ENA_MASK (1U << BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN)

#define PLOTHEIGHT (20)
#define VOLTAGEMIN (2400)
#define VOLTAGEMAX (3100)

/** wakeupVectorIndex Enum */
typedef enum
{
    kWAKEUP_VECTOR_RTC = 0U,
    kWAKEUP_VECTOR_OS_TIMER,
    kWAKEUP_VECTOR_CTIMER,
    kWAKEUP_VECTOR_PINT,
    kWAKEUP_VECTOR_GINT,
    kWAKEUP_VECTOR_WAKEUP_PIN,
    kWAKEUP_VECTOR_WWDT,
    kWAKEUP_VECTOR_BOD1,
    kWAKEUP_VECTOR_GINT_BOD1_ENABLED,
    kWAKEUP_VECTOR_BOD2,
} wakeup_vector_index_t;

/** Configure wakeup timer function type definition */
typedef void (*irqSrcConfigureWakeupTimer_t)(int ms);

/** Configure interrupt source type definition */
typedef void (*irqSrcInit_t)(bool init);

/** Wakeup vector structure */
typedef struct
{
    irqSrcInit_t initWakeUpSourceCb;
    irqSrcConfigureWakeupTimer_t configureWakeUpCb;
    uint64_t wakeupInterruptMask;
    uint32_t excludeFromPd;
} wakeup_vector_t;

/** Menu callback function type definition */
typedef status_t (*menuFunc_t)(wakeup_vector_index_t wakeupVectorIndex);

/** Menu item structure */
typedef struct
{
    /** The title of the menu item */
    const char *title;
    /** The function to call when the item is selected */
    menuFunc_t func;
    /** The parameter to pass to function */
    uint8_t param;
} menu_item_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t Sleep(wakeup_vector_index_t wakeupVectorIndex);
static status_t DeepSleep(wakeup_vector_index_t wakeupVectorIndex);
static status_t PowerDown(wakeup_vector_index_t wakeupVectorIndex);
static status_t DeepPowerDown(wakeup_vector_index_t wakeupVectorIndex);
static status_t PowerOff(wakeup_vector_index_t wakeupVectorIndex);
static status_t Reset(uint8_t param);
static status_t Calibrate(uint8_t param);
static status_t GetPowerLibVersion(uint8_t param);
static status_t GetChipVersion(uint8_t param);
static status_t DemoBODs(uint8_t param);
static status_t VoltageMeasurement(uint8_t param);

static void InitRTC(bool init);
static void InitOSTimer(bool init);
static void InitCTimer(bool init);
static void InitPint(bool init);
static void InitGint(bool init);
static void InitWwdt(bool init);
static void InitBOD1(bool init);
static void InitBOD1Gint(bool init);
static void InitBOD2(bool init);

static void ConfigureRTCWakeUp(int ms);
static void ConfigureOSTimerWakeUp(int ms);
static void ConfigureCTimerWakeUp(int ms);
static void ConfigurePintWakeUp(int ms);
static void ConfigureGintWakeUp(int ms);
static void ConfigureWakeUpPin(int ms);
static void ConfigureWwdtWakeUp(int ms);
static void ConfigureBOD1WakeUp(int ms);
static void ConfigureBOD2Reset(int ms);

static void WaitPinStableHigh(int pin);
static void CTimer_IRQHandler(uint32_t flags);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/** Array of all menu items the user can select from */
static const menu_item_t s_menu[] = {
    {.title = "Get power library version", .func = GetPowerLibVersion, .param = 0},
    {.title = "Get chip version", .func = GetChipVersion, .param = 0},
    {.title = "Go to sleep. Wakeup from RTC timer", .func = Sleep, .param = kWAKEUP_VECTOR_RTC},
    {.title = "Go to sleep. Wakeup from OS timer", .func = Sleep, .param = kWAKEUP_VECTOR_OS_TIMER},
    {.title = "Go to sleep. Wakeup from Ctimer", .func = Sleep, .param = kWAKEUP_VECTOR_CTIMER},
    {.title = "Go to sleep. Wakeup from WWDT", .func = Sleep, .param = kWAKEUP_VECTOR_WWDT},
    {.title = "Go to sleep. Wakeup from pin toggle (PINT)", .func = Sleep, .param = kWAKEUP_VECTOR_PINT},
    {.title = "Go to sleep. Wakeup from pin toggle (GINT)", .func = Sleep, .param = kWAKEUP_VECTOR_GINT},
    {.title = "Go to deep sleep. Wakeup from RTC timer", .func = DeepSleep, .param = kWAKEUP_VECTOR_RTC},
    {.title = "Go to deep sleep. Wakeup from OS timer", .func = DeepSleep, .param = kWAKEUP_VECTOR_OS_TIMER},
    {.title = "Go to deep sleep. Wakeup from Ctimer", .func = DeepSleep, .param = kWAKEUP_VECTOR_CTIMER},
    {.title = "Go to deep sleep. Wakeup from WWDT", .func = DeepSleep, .param = kWAKEUP_VECTOR_WWDT},
    {.title = "Go to deep sleep. Wakeup from pin toggle (PINT)", .func = DeepSleep, .param = kWAKEUP_VECTOR_PINT},
    {.title = "Go to deep sleep. Wakeup from pin toggle (GINT)", .func = DeepSleep, .param = kWAKEUP_VECTOR_GINT},
    {.title = "Go to power down. Wakeup from RTC timer", .func = PowerDown, .param = kWAKEUP_VECTOR_RTC},
    {.title = "Go to power down. Wakeup from OS timer", .func = PowerDown, .param = kWAKEUP_VECTOR_OS_TIMER},
    {.title = "Go to power down. Wakeup from pin toggle (GINT)", .func = PowerDown, .param = kWAKEUP_VECTOR_GINT},
    {.title = "Go to deep power down. Wakeup from RTC timer", .func = DeepPowerDown, .param = kWAKEUP_VECTOR_RTC},
    {.title = "Go to deep power down. Wakeup from OS timer", .func = DeepPowerDown, .param = kWAKEUP_VECTOR_OS_TIMER},
    {.title = "Go to deep power down. Wakeup from pin toggle (always on wakeup pin 21)",
     .func  = DeepPowerDown,
     .param = kWAKEUP_VECTOR_WAKEUP_PIN},
    {.title = "Go to power off. Wakeup from pin toggle (always on wakeup pin 21)",
     .func  = PowerOff,
     .param = kWAKEUP_VECTOR_WAKEUP_PIN},
    {.title = "Reset device", .func = Reset, .param = 0},
    {.title = "Calibrate FROs", .func = Calibrate, .param = 0},
    {.title = "BOD demo", .func = DemoBODs, .param = 0},
    {.title = "Go to sleep. Wakeup from BOD1 interrupt", .func = Sleep, .param = kWAKEUP_VECTOR_BOD1},
    {.title = "Go to deep sleep. Wakeup from BOD1 interrupt", .func = DeepSleep, .param = kWAKEUP_VECTOR_BOD1},
    {.title = "Go to deep sleep. Wakeup from pin toggle (GINT) with BOD1 interrupt enabled",
     .func  = DeepSleep,
     .param = kWAKEUP_VECTOR_GINT_BOD1_ENABLED},
    {.title = "Go to power down. Wakeup from pin toggle (GINT) with BOD1 interrupt enabled",
     .func  = PowerDown,
     .param = kWAKEUP_VECTOR_GINT_BOD1_ENABLED},
    {.title = "Go to sleep. Reset on BOD2", .func = Sleep, .param = kWAKEUP_VECTOR_BOD2},
    {.title = "Go to deep sleep. Reset on BOD2", .func = DeepSleep, .param = kWAKEUP_VECTOR_BOD2},
    {.title = "Go to power down. Reset on BOD2", .func = PowerDown, .param = kWAKEUP_VECTOR_BOD2},
    {.title = "Go to deep power down. Reset on BOD2", .func = DeepPowerDown, .param = kWAKEUP_VECTOR_BOD2},
    {.title = "Voltage measurement", .func = VoltageMeasurement, .param = 0},
    {.title = NULL, .func = NULL}};

/** Array of all possible wakeup vectors */
static wakeup_vector_t s_wakeupVector[] = {{InitRTC, ConfigureRTCWakeUp, kWAKEUP_RTC, kLOWPOWERCFG_FRO32K},
                                           {InitOSTimer, ConfigureOSTimerWakeUp, kWAKEUP_OS_EVENT, kLOWPOWERCFG_FRO32K},
                                           {InitCTimer, ConfigureCTimerWakeUp, kWAKEUP_CTIMER0, kLOWPOWERCFG_FRO32K},
                                           {InitPint, ConfigurePintWakeUp, kWAKEUP_PIN_INT0, kLOWPOWERCFG_NONE},
                                           {InitGint, ConfigureGintWakeUp, kWAKEUP_GINT0, kLOWPOWERCFG_NONE},
                                           {NULL, ConfigureWakeUpPin, kWAKEUP_WAKE_PAD, kLOWPOWERCFG_NONE},
                                           {InitWwdt, ConfigureWwdtWakeUp, kWAKEUP_WDT, kLOWPOWERCFG_FRO1M},
                                           {InitBOD1, ConfigureBOD1WakeUp, kWAKEUP_BOD1, kLOWPOWERCFG_BOD1},
                                           {InitBOD1Gint, ConfigureGintWakeUp, kWAKEUP_GINT0, kLOWPOWERCFG_BOD1},
                                           {InitBOD2, ConfigureBOD2Reset, 0, kLOWPOWERCFG_BOD2}};

/** Variable to keep track which dc/dc mode is used. */
static dcdc_mode_t s_supplyMode;

/** Ctimer callback table. */
static ctimer_callback_t s_ctimerCallbackTable[] = {CTimer_IRQHandler};

/** Variable to keep whether the BOD1 interrupt was handled. */
static volatile bool BOD1InterruptHandled = false;

