nxp-mcuxpresso/mcuxsdk-examples/demo_apps/power_mode_switch_mcxw23/power_mode_switch_mcxw23.c
/*******************************************************************************
 * Code
 ******************************************************************************/

void RTC_IRQHandler(void)
{
    RTC_ClearStatusFlags(RTC, kRTC_WakeupFlag);
    RTC_EnableTimer(RTC, false);
}

static void InitRTC(bool init)
{
    if (init)
    {
        PRINTF("Init RTC\n");
        POWER_PeripheralPowerOn(kPOWERCFG_FRO32K);
        CLOCK_Select32kOscClkSrc(kCLOCK_Osc32kClockSrc_FRO);
        RTC_Init(RTC);
        SYSTEM_CalibrateRTCClockDividers();
        RTC_EnableWakeupTimer(RTC, true);
        EnableIRQ(RTC_IRQn);
    }
    else
    {
        PRINTF("De-Init RTC\n");
        RTC_EnableWakeupTimer(RTC, false);
        DisableIRQ(RTC_IRQn);
        RTC_Deinit(RTC);
    }
}

static void ConfigureRTCWakeUp(int ms)
{
    RTC_SetWakeupCount(RTC, ms);
    RTC_EnableTimer(RTC, true);

    PRINTF("Waking up from RTC after %d ms\n", ms);
}

void OSTimer_IRQHandler(void)
{
    OSTIMER_ClearStatusFlags(OSTIMER, kOSTIMER_MatchInterruptFlag);
}

static void InitOSTimer(bool init)
{
    if (init)
    {
        PRINTF("Init OS Timer\n");
        POWER_PeripheralPowerOn(kPOWERCFG_FRO32K);
        CLOCK_Select32kOscClkSrc(kCLOCK_Osc32kClockSrc_FRO);
        OSTIMER_Init(OSTIMER);
    }
    else
    {
        PRINTF("De-Init OS Timer\n");
        OSTIMER_Deinit(OSTIMER);
    }
}

static void ConfigureOSTimerWakeUp(int ms)
{
    uint64_t timerTicks = OSTIMER_GetCurrentTimerValue(OSTIMER);
    timerTicks += MSEC_TO_COUNT(ms, 32768);
    OSTIMER_SetMatchValue(OSTIMER, timerTicks, OSTimer_IRQHandler);
}

static void InitCTimer(bool init)
{
    if (init)
    {
        PRINTF("Init CTimer\n");
        ctimer_config_t config;
        /* Enable 32KHz FRO, used as ctimer clock*/
        POWER_PeripheralPowerOn(kPOWERCFG_FRO32K);
        CLOCK_AttachClk(kOSC32K_to_CTIMER0);
        CTIMER_GetDefaultConfig(&config);
        CTIMER_Init(CTIMER0, &config);
        CTIMER_RegisterCallBack(CTIMER0, &s_ctimerCallbackTable[0], kCTIMER_SingleCallback);
    }
    else
    {
        PRINTF("De-Init Ctimer\n");
        CTIMER_Deinit(CTIMER0);
    }
}

static void ConfigureCTimerWakeUp(int ms)
{
    ctimer_match_config_t matchConfig;
    matchConfig.enableCounterReset = true;
    matchConfig.enableCounterStop  = false;
    matchConfig.matchValue         = MSEC_TO_COUNT(ms, CLOCK_GetCTimerClkFreq(0));
    matchConfig.outControl         = kCTIMER_Output_Toggle;
    matchConfig.outPinInitState    = false;
    matchConfig.enableInterrupt    = true;
    CTIMER_SetupMatch(CTIMER0, kCTIMER_Match_0, &matchConfig);
    CTIMER_StartTimer(CTIMER0);
}

void CTimer_IRQHandler(uint32_t flags)
{
    (void)flags;
    CTIMER_ClearStatusFlags(CTIMER0, kCTIMER_Match0Flag);
    CTIMER_StopTimer(CTIMER0);
}

void WDT_IRQHandler(void)
{
    uint32_t wdtStatus = WWDT_GetStatusFlags(WWDT);
    if (wdtStatus & kWWDT_TimeoutFlag)
    {
        WWDT_ClearStatusFlags(WWDT, kWWDT_TimeoutFlag);
    }
    if (wdtStatus & kWWDT_WarningFlag)
    {
        WWDT_ClearStatusFlags(WWDT, kWWDT_WarningFlag);
    }
    /* Refresh WWDT to avoid timeout */
    WWDT_Refresh(WWDT);
}

/* WDT_BOD_IRQHandler also exists. This is a combined interrupt that is triggered when WDT, BOD1 or BOD2 interrupt is
   triggered.
   To simplify the handling, we only use the single-source interrupts for WDT and BOD1. BOD2 interrupt is not used in
   this demo. */
void BOD1_IRQHandler(void)
{
    PRINTF("BOD1 IRQ\n");

    /* Re-configure BOD1 to not generate an interrupt anymore. Otherwise, the BOD1 interrupt will be triggered again
       immediately as long as the voltage level stays below the threshold.*/
    POWER_ConfigureBOD1(kBOD_NO_ACTION);

    /* Clear the interrupt in the BOD status registers. */
    POWER_ClearBOD1Interrupt();

    /* Signal to the main loop that a BOD interrupt was handled and the BOD1 interrupt is disabled.
        The main loop will enable the BOD1 interrupt again when the voltage level is above the threshold again. */
    BOD1InterruptHandled = true;

    PRINTF("BOD1 IRQ disabled. Raise voltage above 2.2V to re-enable BOD1\n");
}

static void InitBOD1(bool init)
{
    if (init)
    {
        PRINTF("BOD1 configured to generate an interrupt at Vbat 2.2V\n");
        POWER_ClearBOD1Interrupt();
        BOD1InterruptHandled = false;
        POWER_SetBod1Level(kBOD_LEVEL_2200mv);
        POWER_ConfigureBOD1(kBOD_INTERRUPT);

        NVIC_EnableIRQ(BOD1_IRQn);
    }
    else
    {
        PRINTF("De-Init BOD1 interrupt\n");
        POWER_ConfigureBOD1(kBOD_NO_ACTION);
        NVIC_DisableIRQ(BOD1_IRQn);
    }
}

static void ConfigureBOD1WakeUp(int ms)
{
    PRINTF("Lower voltage below 2.2V, to wake me up\n");
}

static void InitBOD1Gint(bool init)
{
    InitGint(init);
    InitBOD1(init);
}

static void InitBOD2(bool init)
{
    if (init)
    {
        PRINTF("BOD2 configured to reset at Vbat 1.8V\n");
        POWER_SetBod2Level(kBOD_LEVEL_1800mv);
        POWER_ConfigureBOD2(kBOD_RESET);
    }
    else
    {
        PRINTF("De-Init BOD2 reset\n");
        POWER_ConfigureBOD2(kBOD_NO_ACTION);
    }
}

static void ConfigureBOD2Reset(int ms)
{
    PRINTF("Lower voltage below 1.8V, to reset\n");
}

static void InitWwdt(bool init)
{
    if (init)
    {
        PRINTF("Init Wwdt\n");
        CLOCK_Enable1MFRO(true);
        /* Clock WWDT at 100KHz, this will give us 40ms between warning and timeout */
        CLOCK_SetClkDiv(kCLOCK_DivWdtClk, 10U, true);
        NVIC_EnableIRQ(WDT_IRQn);
    }
    else
    {
        PRINTF("De-Init Wwdt\n");
        CLOCK_Enable1MFRO(false);
        WWDT_Deinit(WWDT);
    }
}

static void ConfigureWwdtWakeUp(int ms)
{
    wwdt_config_t config;
    uint32_t wdtFreq;
    wdtFreq = CLOCK_GetWdtClkFreq() / 4;

    /* Configure WWDT such that warning happens after ms milliseconds. */
    WWDT_GetDefaultConfig(&config);
    config.warningValue        = 0x3ff;
    config.timeoutValue        = wdtFreq * ms / 1000 + config.warningValue;
    config.windowValue         = 0xFFFFFF;
    config.enableWatchdogReset = false;
    config.clockFreq_Hz        = CLOCK_GetWdtClkFreq();
    WWDT_Init(WWDT, &config);
}

