nxp-mcuxpresso/mcuxsdk-examples/demo_apps/power_mode_switch_mcxw23/power_mode_switch_mcxw23.c
void Pint_IRQHandler(pint_pin_int_t pintr, pint_status_t *status)
{
}

static void InitPint(bool init)
{
    if (init)
    {
        PRINTF("Init PINT\n");
        INPUTMUX_Init(INPUTMUX);
        INPUTMUX_AttachSignal(INPUTMUX, kPINT_PinInt0, PIN_INT_SRC);
        /* Turnoff clock to inputmux to save power. Clock is only needed to make changes */
        INPUTMUX_Deinit(INPUTMUX);

        PINT_Init(PINT);
        PINT_PinInterruptConfig(PINT, kPINT_PinInt0, kPINT_PinIntEnableFallEdge);
        PINT_SetCallback(PINT, Pint_IRQHandler);
        PINT_EnableCallbackByIndex(PINT, kPINT_PinInt0);
    }
    else
    {
        PRINTF("De-Init PINT\n");
        PINT_DisableCallbackByIndex(PINT, kPINT_PinInt0);
        PINT_Deinit(PINT);
    }
}

void Gint_IRQHandler(void)
{
    GINT_ClrStatus(GINT0);
}

static void ConfigurePintWakeUp(int ms)
{
    /* Make sure pin is debounced before using it (from potential previous usage)*/
    WaitPinStableHigh(BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN);

    PRINTF("Push USER button, to wake me up\n");
}

static void InitGint(bool init)
{
    if (init)
    {
        PRINTF("Init GINT\n");
        GINT_Init(GINT0);
        GINT_SetCtrl(GINT0, kGINT_CombineOr, kGINT_TrigLevel, Gint_IRQHandler);
        GINT_ConfigPins(GINT0, GINT0_PORT, GINT0_POL_MASK, GINT0_ENA_MASK);
        GINT_EnableCallback(GINT0);
    }
    else
    {
        PRINTF("De-Init GINT\n");
        GINT_DisableCallback(GINT0);
        GINT_Deinit(GINT0);
    }
}

static void ConfigureGintWakeUp(int ms)
{
    /* Make sure pin is debounced before using it (from potential previous usage)*/
    WaitPinStableHigh(BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN);

    PRINTF("Push USER button, to wake me up\n");
}

static void ConfigureWakeUpPin(int ms)
{
    /* Make sure pin is debounced before using it (from potential previous usage)*/
    WaitPinStableHigh(BOARD_INITPINS_BOARD_WAKEUP_GPIO_PIN_PIN);

    PRINTF("Push WAKEUP button, to wake me up\n");
}

static void WaitPinStableHigh(int pin)
{
    int pinValue;
    int pinValueHighcount         = 0;
    int loopCounter               = 0;
    const int pinValueStableCount = 4 * 1024;
    const int maxLoopCounter      = 1024 * 1024;

    do
    {
        pinValue = GPIO_PinRead(GPIO, 0U, pin);
        if (pinValue == 1)
        {
            /* Wakeup pin has pull up, so expected value is 1 when pin is not being triggered.*/
            pinValueHighcount++;
        }
        else
        {
            pinValueHighcount = 0;
        }
        loopCounter++;
        if (loopCounter > maxLoopCounter)
        {
            /* After maxLoopCounter we consider debouncing as failed and we stop the loop. */
            PRINTF("Wakeup pin debouncing timeout\n");
            return;
        }

    } while (pinValueHighcount < pinValueStableCount);
    PRINTF("Wakeup pin debounced\n");
}

static void ConfigureWakeup(int wakeupVectorIndex, int sleepTimeMs)
{
    if (s_wakeupVector[wakeupVectorIndex].configureWakeUpCb)
    {
        s_wakeupVector[wakeupVectorIndex].configureWakeUpCb(sleepTimeMs);
    }
}

static void InitWakupSource(int wakeupVectorIndex)
{
    if (s_wakeupVector[wakeupVectorIndex].initWakeUpSourceCb)
    {
        s_wakeupVector[wakeupVectorIndex].initWakeUpSourceCb(true);
    }
}

static void DeInitWakupSource(int wakeupVectorIndex)
{
    if (s_wakeupVector[wakeupVectorIndex].initWakeUpSourceCb)
    {
        s_wakeupVector[wakeupVectorIndex].initWakeUpSourceCb(false);
    }
}

static status_t GetPowerLibVersion(uint8_t param)
{
    uint32_t libVersion = POWER_GetLibVersion();
    uint8_t major       = libVersion >> 16;
    uint8_t minor       = libVersion >> 8 & 0xFF;
    uint8_t bugfix      = libVersion & 0xFF;
    PRINTF("Power library version: %d.%d.%d\n", major, minor, bugfix);
    return kStatus_Success;
}

static status_t GetChipVersion(uint8_t param)
{
    uint32_t chipVersion = SYSTEM_GetChipVersion();
    PRINTF("Chip version: MCXW23 %0x\n", chipVersion);
    return kStatus_Success;
}

static status_t Reset(uint8_t param)
{
    PRINTF("Resetting device. Here we go!\n");
    POWER_Reset();
    return kStatus_Success;
}

static status_t Calibrate(uint8_t param)
{
    uint32_t measuredFreq;
    PRINTF("Calibrate 32k FRO:\n");
    measuredFreq = SYSTEM_MeasureFrequency(kFREQMEAS_target_clock_32kHz_FRO, kFREQMEAS_ref_time_exp_26);
    PRINTF("Measured frequency before calibration: %d Hz\n", measuredFreq);
    PRINTF("Calibrating ...\n");
    SYSTEM_CalibrateClock(kFREQMEAS_target_clock_32kHz_FRO);
    SYSTEM_CalibrateClockFine(kFREQMEAS_target_clock_32kHz_FRO);
    PRINTF("Measured frequency after calibration: %d Hz\n", measuredFreq);
    PRINTF("\n");

    PRINTF("Calibrate 1MHZ FRO:\n");
    measuredFreq = SYSTEM_MeasureFrequency(kFREQMEAS_target_clock_1MHz_FRO, kFREQMEAS_ref_time_exp_26);
    PRINTF("Measured frequency before calibration: %d Hz\n", measuredFreq);
    PRINTF("Calibrating ...\n");
    SYSTEM_CalibrateClock(kFREQMEAS_target_clock_1MHz_FRO);
    SYSTEM_CalibrateClockFine(kFREQMEAS_target_clock_1MHz_FRO);
    PRINTF("Measured frequency after calibration: %d Hz\n", measuredFreq);
    PRINTF("\n");

    PRINTF("Calibrate 12MHZ FRO:\n");
    measuredFreq = SYSTEM_MeasureFrequency(kFREQMEAS_target_clock_12_24_32MHz_FRO, kFREQMEAS_ref_time_exp_26);
    PRINTF("Measured frequency before calibration: %d Hz\n", measuredFreq);
    PRINTF("Calibrating ...\n");
    SYSTEM_CalibrateClock(kFREQMEAS_target_clock_12_24_32MHz_FRO);
    SYSTEM_CalibrateClockFine(kFREQMEAS_target_clock_12_24_32MHz_FRO);
    PRINTF("Measured frequency after calibration: %d Hz\n", measuredFreq);

    return kStatus_Success;
}

static status_t DemoBODs(uint8_t param)
{
    /* BODs will be enabled for about 5 minutes. */
    int demoLoopTimeout = 300;

    InitBOD1(true);
    InitBOD2(true);

    PRINTF("\nLower voltage between 1.8V and 2.2V to trigger BOD1 interrupt\n");
    PRINTF("Lower voltage below 1.8V to trigger BOD2 reset\n\n");

    while (demoLoopTimeout--)
    {
        PRINTF("%d\n", demoLoopTimeout);
        PRINTF("BOD1: %s\n", (POWER_IsBOD1Active() ? "active" : "not active"));
        PRINTF("BOD2: %s\n", (POWER_IsBOD2Active() ? "active" : "not active"));

