nxp-mcuxpresso/mcuxsdk-examples/demo_apps/power_mode_switch_mcxw23/power_mode_switch_mcxw23.c
        if (BOD1InterruptHandled)
        {
            /* BOD 1 interrupt triggered and was handled. If BOD1 is no longer active, we can re-enable the BOD1
             * interrupt. */
            if (!POWER_IsBOD1Active())
            {
                PRINTF("BOD1 configured to generate an interrupt again\n");
                BOD1InterruptHandled = false;
                POWER_ClearBOD1Interrupt();
                POWER_ConfigureBOD1(kBOD_INTERRUPT);
            }
        }
        /* Delay 1 second to avoid spamming the UART with output. */
        SDK_DelayAtLeastUs(1000 * 1000, SystemCoreClock);
    }

    PRINTF("Disabling BODs\n");
    InitBOD1(false);
    InitBOD2(false);

    return kStatus_Success;
}

static status_t Sleep(wakeup_vector_index_t wakeupVectorIndex)
{
    /* Init wake up source */
    InitWakupSource(wakeupVectorIndex);

    /* Configure the wake up source */
    ConfigureWakeup(wakeupVectorIndex, SLEEP_TIME_MS);

    /* Go to sleep */
    PRINTF("Going to sleep.\n");
    PRINTF("...zZZzzzZZzZZzzzZZ...\n");

    POWER_EnterSleep();
    PRINTF("Woken up from sleep. Time for coffee.\n");

    /* De-init wake up source */
    DeInitWakupSource(wakeupVectorIndex);

    return kStatus_Success;
}

static status_t DeepSleep(wakeup_vector_index_t wakeupVectorIndex)
{
    status_t status;
    uint32_t excludeFromPd;

    /* Init wake up source */
    InitWakupSource(wakeupVectorIndex);

    /* Configure the wake up source */
    ConfigureWakeup(wakeupVectorIndex, SLEEP_TIME_MS);

    excludeFromPd = s_wakeupVector[wakeupVectorIndex].excludeFromPd;

    /* Go to deep sleep */
    PRINTF("Going to deep sleep.\n");
    PRINTF("...zZZzzzZZzZZzzzZZ...\n");

    status = POWER_EnterDeepSleep(excludeFromPd, s_wakeupVector[wakeupVectorIndex].wakeupInterruptMask);
    if (status != kStatus_Success)
    {
        PRINTF("POWER_EnterDeepSleep failed with error code 0x%x\n", status);
    }

    PRINTF("Woken up from deep sleep. Had a great nap.\n");

    /* De-init wake up source */
    DeInitWakupSource(wakeupVectorIndex);

    return status;
}

static status_t PowerDown(wakeup_vector_index_t wakeupVectorIndex)
{
    status_t status;
    uint32_t excludeFromPd;

    /* Init wake up source */
    InitWakupSource(wakeupVectorIndex);

    /* Configure the wake up source */
    ConfigureWakeup(wakeupVectorIndex, SLEEP_TIME_MS);

    excludeFromPd = s_wakeupVector[wakeupVectorIndex].excludeFromPd;

    /* Go to power down */
    PRINTF("Going to power down, with CPU retention enabled.\n");
    PRINTF("...zZZzzzZZzZZzzzZZ...\n");

    status = POWER_EnterPowerDown(excludeFromPd, s_wakeupVector[wakeupVectorIndex].wakeupInterruptMask,
                                  kCPU_RETENTION_ENABLE);
    if (status != kStatus_Success)
    {
        PRINTF("POWER_EnterPowerDown failed with error code 0x%x\n", status);
    }
    else
    {
        /* When waking up from power down, with CPU retention, hardware has to be reinitialized. */
        BOARD_InitPins();
        BOARD_InitDebugConsole();
    }

    PRINTF("Woken up from power down. Still a bit fuzzy.\n");

    /* De-init wake up source */
    DeInitWakupSource(wakeupVectorIndex);

    return status;
}

static status_t DeepPowerDown(wakeup_vector_index_t wakeupVectorIndex)
{
    status_t status;
    uint32_t excludeFromPd;
    uint32_t wakeupIoCtrl;

    /* Init wake up source */
    InitWakupSource(wakeupVectorIndex);

    /* Configure the wake up source */
    ConfigureWakeup(wakeupVectorIndex, SLEEP_TIME_MS);

    excludeFromPd = s_wakeupVector[wakeupVectorIndex].excludeFromPd;

    if (s_wakeupVector[wakeupVectorIndex].wakeupInterruptMask == kWAKEUP_WAKE_PAD)
    {
        /* FRDM and EVK boards have pull up on wakeup pin, so configure wakeup pin for pull up and trigger wakeup
         * when it goes low*/
        wakeupIoCtrl = kWAKEUP_PIN_ENABLE | kWAKEUP_PIN_PUP_EN | kWAKEUP_PIN_WAKEUP_LOW_LVL;
    }
    else
    {
        wakeupIoCtrl = kWAKEUP_PIN_DISABLE;
    }

    /* Go to deep power down */
    PRINTF("Going to deep power down.\n");
    PRINTF("...zZZzzzZZzZZzzzZZ...\n");
    PRINTF("Expecting reboot after wakeup.\n");

    status =
        POWER_EnterDeepPowerDown(excludeFromPd, s_wakeupVector[wakeupVectorIndex].wakeupInterruptMask, wakeupIoCtrl);
    if (status != kStatus_Success)
    {
        PRINTF("POWER_EnterDeepPowerDown failed with error code 0x%x\n", status);
    }
    else
    {
        /* Should never come here, device will reboot after wakeup from deep power down.*/
    }

    return status;
}

static status_t PowerOff(wakeup_vector_index_t wakeupVectorIndex)
{
    status_t status;
    uint32_t excludeFromPd;
    uint32_t wakeupIoCtrl;

    /* Init wake up source */
    InitWakupSource(wakeupVectorIndex);

    /* Configure the wake up source */
    ConfigureWakeup(wakeupVectorIndex, SLEEP_TIME_MS);

    excludeFromPd = s_wakeupVector[wakeupVectorIndex].excludeFromPd;

    if (s_wakeupVector[wakeupVectorIndex].wakeupInterruptMask == kWAKEUP_WAKE_PAD)
    {
        /* FRDM and EVK boards have pull up on wakeup pin, so configure wakeup pin for pull up and trigger wakeup
         * when it goes low*/
        wakeupIoCtrl = kWAKEUP_PIN_ENABLE | kWAKEUP_PIN_PUP_EN | kWAKEUP_PIN_WAKEUP_LOW_LVL;
    }
    else
    {
        wakeupIoCtrl = kWAKEUP_PIN_DISABLE;
    }

    /* Go to power off */
    PRINTF("Going to power off.\n");
    PRINTF("...zZZzzzZZzZZzzzZZ...\n");
    PRINTF("Expecting reboot after wakeup.\n");

    status = POWER_EnterPowerOff(excludeFromPd, wakeupIoCtrl);
    if (status != kStatus_Success)
    {
        PRINTF("POWER_EnterPowerOff failed with error code 0x%x\n", status);
    }
    else
    {
        /* Should never come here, device will reboot after wakeup from power off.*/
    }

    return status;
}

static void DrawPlot(uint32_t measurementSize)
{
    for (uint32_t i = 0; i < PLOTHEIGHT; i++)
    {
        if (i == 0 || i == PLOTHEIGHT - 1)
        {
            PRINTF("%d mv |\n", i == 0 ? VOLTAGEMAX : VOLTAGEMIN);
        }
        else
        {
            PRINTF("        |\n");
        }
    }
    char line[measurementSize + 1];
    memset(line, '-', measurementSize);
    line[measurementSize] = '\0';
    PRINTF("        -%s\n", line);
}

