nxp-mcuxpresso/mcuxsdk-examples/demo_apps/power_mode_switch_mcxw23/power_mode_switch_mcxw23.c
static void DrawBar(uint32_t col, uint32_t voltage)
{
    uint32_t range = VOLTAGEMAX - VOLTAGEMIN;
    /* Move cursor to right location */
    PRINTF("\033[%dA\r\033[%dC", PLOTHEIGHT + 1, col + 9);
    for (uint32_t i = 0; i < PLOTHEIGHT; i++)
    {
        PRINTF("%c \033[2D\033[1B", voltage >= VOLTAGEMAX - range * i / (PLOTHEIGHT - 1) ? '*' : ' ');
    }
    PRINTF("\n");
}

static status_t VoltageMeasurement(uint8_t param)
{
    uint32_t measurements[80];
    uint32_t measurementPos = 0;
    uint32_t active         = 1;
    uint32_t counter        = 0;

    PRINTF("Press user button to stop demo\n");
    DrawPlot(ARRAY_SIZE(measurements));

    while (active)
    {
        SDK_DelayAtLeastUs(50000, SystemCoreClock);
        counter++;
        /* Toggle LED every 20 * 50ms = 1s */
        if (counter == 20)
        {
            LED_TOGGLE();
            counter = 0;
        }
        POWER_MeasureVoltageWithBod1(measurements + measurementPos);
        DrawBar(measurementPos, measurements[measurementPos]);
        PRINTF("\r%d mv", measurements[measurementPos]);
        measurementPos = (measurementPos + 1) % ARRAY_SIZE(measurements);
        active         = GPIO_PinRead(BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_GPIO, 0U, BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN);
    }

    LED_TOGGLE();
    return kStatus_Success;
}

/**
 * Reads a single line from UART. A line ends when a \r or \n is
 * detected. The function is safe in the sense that it assures that
 * the passed buffer is never overflown.
 *
 * @param buffer The buffer to store the line
 * @param bufferSize The size of the buffer in bytes
 */
static void ReadLine(char *buffer, uint32_t bufferSize)
{
    char *p = buffer;
    while (true)
    {
        *p = DbgConsole_Getchar();
        PRINTF("%c", *p);
        /* Is it a backspace? */
        if (*p == 8 || *p == 0x7f)
        {
            /* Yes, are we at the beginning of the buffer? */
            if (p != buffer)
            {
                /* No, then we can remove safely the previous character */
                p--;
            }
        }
        /* Is it a new-line or carriage-return? */
        else if (*p == '\n' || *p == '\r')
        {
            /* Yes, then we're done. Close the string with a terminating zero */
            *p = '\0';
            break;
        }
        /* Is the pointer pointing to the last element in the array? */
        else if (p != &buffer[bufferSize - 1])
        {
            /* No, then we can progress to the next character in the array */
            p++;
        }
    }
}

/**
 * Displays all menu items with a unique selector
 */
static void ShowMenu()
{
    const menu_item_t *item = s_menu;
    uint32_t idx            = 0;

    PRINTF("\n================= SELECT FROM MENU =================\n\n");
    while (item->title != NULL)
    {
        if (idx < 26)
        {
            PRINTF("%c. %s\r\n", 'a' + idx, item->title);
        }
        else
        {
            PRINTF("%c. %s\r\n", 'A' + idx - 26, item->title);
        }
        item++;
        idx++;
    }
}

/**
 * Calls the callback function of the given menu item and prints the result
 *
 * @param item The menu item to execute
 * @return The result of the test
 */
static status_t ExecuteMenuItem(const menu_item_t *item)
{
    PRINTF("\n----------------------------------------------------\n");
    PRINTF("SELECTED: %s\n", item->title);
    PRINTF("----------------------------------------------------\n");

    status_t status = item->func(item->param);
    return status;
}

/**
 * This function waits for user input and executes the selected test
 */
static void HandleMenu()
{
    const menu_item_t *item = NULL;
    static char input[256];

    ShowMenu();
    PRINTF("> ");
    ReadLine(input, sizeof(input));
    PRINTF("\r\n");

    /* Check whether the user has selected a valid menu item */
    if (input[0] >= 'a')
    {
        uint8_t idx = input[0] - 'a';
        item        = s_menu;
        while ((idx > 0) && (item->title != NULL))
        {
            idx--;
            item++;
        }
        if (item->title == NULL)
        {
            item = NULL;
        }
    }
    else
    {
        if (input[0] >= 'A')
        {
            uint8_t idx = input[0] - 'A' + 26;
            item        = s_menu;
            while ((idx > 0) && (item->title != NULL))
            {
                idx--;
                item++;
            }
            if (item->title == NULL)
            {
                item = NULL;
            }
        }
    }

    /* Is a valid item selected? */
    if (item)
    {
        /* Yes, then execute it */
        ExecuteMenuItem(item);
        PRINTF("\r\n");
    }
    else
    {
        /* No, inform the user */
        PRINTF("Invalid menu option\r\n");
    }
}
/*!
 * @brief Main function
 */
int main(void)
{
    reset_cause_t resetCause;

    BOARD_InitHardware();

    /* Get supply mode, this info is needed to determine correct parameters of low power modes.*/
    s_supplyMode = POWER_DCDC_GetSupplyMode();

    /* Get reset cause, this info is needed to know if the application was booted because of a wakeup or because of a
     * reset. */
    resetCause = POWER_GetResetCause();

    /* After waking up from deep power down from RTC, RTC interrupt is still fired,
    so we need to make sure RTC block is initialized (e.g. has clock), to be able to handle interrupt*/
    RTC_Init(RTC);

    PRINTF("\n\n====================================================\n");
    PRINTF("!!!MCXW23 BOOTED!!!\n");
    PRINTF("Boot reason: ");

    /* Inform the user why the application was rebooted */
    switch (resetCause)
    {
        case kRESET_CAUSE_PAD:
        {
            PRINTF("hardware reset");
            break;
        }
        case kRESET_CAUSE_SWR:
        {
            PRINTF("software reset");
            break;
        }
        case kRESET_CAUSE_BOD:
        {
            PRINTF("BOD reset");
            break;
        }
        case kRESET_CAUSE_RTC:
        {
            PRINTF("RTC wakeup");
            break;
        }
        case kRESET_CAUSE_OST:
        {
            PRINTF("OS timer wakeup");
            break;
        }
        case kRESET_CAUSE_DPD_IO:
        {
            /* When waking up from deep sleep using wakup pin, kRESET_CAUSE_DPD_IO is reset cause. */
            PRINTF("wake up from pin 21");
            break;
        }
        case kRESET_CAUSE_POR:
        {
            /* When waking up from power off using wakup pin, kRESET_CAUSE_POR is reset cause. */
            PRINTF("wake up from pin 21");
            break;
        }
        default:
        {
            PRINTF("0x%x not used in this demo", (uint32_t)resetCause);
            break;
        }
    }

    PRINTF("\nDC/DC mode: ");
    switch (s_supplyMode)
    {
        case kDCDC_MODE_HV_SM:
        {
            PRINTF("buck mode (HV)");
            break;
        }
        case kDCDC_MODE_XR_SM_SS:
        {
            PRINTF("XR_SM_SS mode");
            break;
        }
        case kDCDC_MODE_XR_SM_DS:
        {
            PRINTF("XR_SM_DS mode");
            break;
        }
        default:
        {
            PRINTF("not used in this demo");
            break;
        }
    }
    PRINTF("\nDC/DC startup duration: %d us\n", POWER_DCDC_GetStartupDuration());

    PRINTF("====================================================\n");

    while (true)
    {
        HandleMenu();
    }
    return 0;
}
